[
    {
        "th_name": "วิธีการติดตั้ง Microsoft Office 2013",
        "eng_name": "How to install Microsoft Office 2013",
        "color": "bg-pink-200",
        "type": "data",
        "book_id": 20,
        "content": [
            {
                "text": "1.แตกไฟล์ .zip ออกมาดังภาพประกอบ",
                "image": "file_path.jpg"
            },
            {
                "text": "2. จากนั้นจะได้ Folder ที่ด้านในประกอบด้วยไฟล์สำหรับติดตั้ง",
                "image": "file_path.jpg"
            }
        ]
    },
    {
        "th_name": "คอมพิวเตอร์และการบำรุงรักษา",
        "eng_name": "Computer and maintenance",
        "color": "bg-purple-200",
        "type": "topic",
        "data": [
            {
                "chapter": "บทที่ 1",
                "label": "ความรู้พื้นฐานเกี่ยวกับคอมพิวเตอร์",
                "sections": [
                    {
                        "title": "1. ความหมายของคอมพิวเตอร์ (Computer)",
                        "content": [
                            {
                                "text": "คำว่า คอมพิวเตอร์ มาจากภาษา ละตินว่า Computare หมายถึง เครื่องคำนวณ เครื่องจักรทางอิเล็กทรอนิกส์ที่สร้างขึ้นสามารถเก็บข้อมูล ป้อนข้อมูลพร้อมคำสั่ง แล้วแสดงผลออกมาในรูปแบบต่างๆ ได้อย่างรวดเร็วถูกต้องศิริภัทรา เหมือนมาลัย (2548 : 2) ได้ให้ความหมายของคอมพิวเตอร์ว่า “อุปกรณ์ทางอิเล็กทรอนิกส์ที่สามารถรับ และจดจำคำสั่งที่เป็นตัวเลข ตัวอักษร หรืออักขระพิเศษ เพื่อนำไปประมวลผลแล้วได้รับผลลัพธ์ตามที่ต้องการอย่างถูกต้องรวดเร็ว”พจนานุกรม ฉบับราชบัณฑิตยสถาน พ.ศ. 2542 ให้ความหมายของคอมพิวเตอร์ไว้ว่า “เครื่องอิเล็กทรอนิกส์แบบอัตโนมัติ ทำหน้าที่เหมือนสมองกล ใช้สำหรับแก้ปัญหาต่างๆ ทั้งที่ง่ายและซับซ้อนโดยวิธีทางคณิตศาสตร์” สรุป คอมพิวเตอร์ คือ อุปกรณ์อิเล็กทรอนิกส์ที่มนุษย์สร้างขึ้น เพื่อช่วยในการทำงานให้มีประสิทธิภาพ สามารถรับข้อมูล  จดจำข้อมูล เพื่อนำข้อมูลไปประมวลผล และแสดงผลลัพธ์ตามรูปแบบที่เราต้องการได้"
                            }
                        ]
                    },
                    {
                        "title": "2. ประเภทคอมพิวเตอร์",
                        "content": [
                            {
                                "text": "ในปัจจุบันจะพบว่าเทคโนโลยีทางด้านคอมพิวเตอร์มีการพัฒนาเปลี่ยนแปลงไป อย่างรวดเร็วมาก ทำให้มีเครื่องคอมพิวเตอร์ให้เลือกใช้มากมายหลายรูปแบบตามความต้องการ ของผู้ใช้ ดังนั้นจึงมีการแบ่งคอมพิวเตอร์โดยใช้เกณฑ์ในการพิจารณาดังนี้ 2.1 ประเภทคอมพิวเตอร์ตามลักษณะการประมวลผลข้อมูล สามารถแบ่งได้เป็น 3 ประเภท คือ 1) แอนะล็อกคอมพิวเตอร์ (Analog Computer) การทำงานโดยใช้หลักการวัดข้อมูลที่เป็นสัญญาณต่อเนื่อง เหมาะสำหรับงานคำนวณทางวิทยาศาสตร์ และวิศวกรรมที่อยู่ในรูปของสมการคณิตศาสตร์ เช่น การจำลองการบิน การศึกษาการสั่นสะเทือนของตึกเนื่องจากแผ่นดินไหว ข้อมูลตัวแปรนำเข้าอาจเป็น อุณหภูมิ ความเร็ว หรือความดันอากาศ ซึ่งข้อมูลที่วัดได้อาจมีค่าไม่คงที่อาจเป็นค่าโดยประมาณ",
                                "imageCradit": {
                                    "file": "chapter1/1-01.jpg",
                                    "des": "ภาพที่  1-1 แอนะล็อกคอมพิวเตอร์ (Analog Computer)",
                                    "ref": "(ที่มา: http://www.digibarn.com)"
                                }
                            },
                            {
                                "text": "2)  ดิจิตอลคอมพิวเตอร์ (Digital Computer) การทำงานโดยใช้หลักการนับลักษณะข้อมูลไม่ต่อเนื่อง โดยใช้ระบบเลขฐานสองที่มีสัญลักษณ์ตัวเลข 0 และ 1 แทนข้อมูล ข้อมูลที่ได้จะเป็นค่าที่แน่นอน ซึ่งคอมพิวเตอร์ที่ใช้งานทั่วไปในปัจจุบันจัดเป็นดิจิตอลคอมพิวเตอร์เกือบทั้งหมด",
                                "imageCradit": {
                                    "file": "chapter1/1-02.jpg",
                                    "des": "ภาพที่ 1-2 ดิจิตอลคอมพิวเตอร์ (Digital Computer)",
                                    "ref": "(ที่มา: http://www.digibarn.com)"
                                }
                            },
                            {
                                "text": "3)  ไฮบริดคอมพิวเตอร์ (Hybrid Computer) การนำลักษณะของคอมพิวเตอร์แบบแอนะล็อก และแบบดิจิตอล มาทำงานร่วมกัน เช่น การพยากรณ์อากาศ จะใช้การวัดค่าอุณหภูมิแบบแอนะล็อก แล้วนำข้อมูลที่วัดได้ แปลงค่าเป็นตัวเลข แล้วทำการประมวลผลในระบบดิจิตอล เพื่อให้ได้ผลลัพธ์ที่ถูกต้อง",
                                "imageCradit": {
                                    "file": "chapter1/1-03.jpg",
                                    "des": "ภาพที่ 1-3 ไฮบริดจ์คอมพิวเตอร์ (Hybrid Computer)",
                                    "ref": "(ที่มา: http://www.digibarn.com)"
                                }
                            },
                            {
                                "text": "2.2  ประเภทคอมพิวเตอร์ตามลักษณะการใช้งาน  สามารถแบ่งได้เป็น 2 ประเภทคือ 1)  คอมพิวเตอร์แบบใช้งานทั่วไป (General Purpose Computer) เป็นคอมพิวเตอร์ที่สามารถนำมาประยุกต์ใช้กับงานต่าง ๆ ได้หลายด้านในเครื่องเดียวกัน 2)  คอมพิวเตอร์แบบใช้งานเฉพาะกิจ (Special Purpose Computer) เป็นคอมพิวเตอร์ที่ถูกออกแบบมาเพื่อใช้กับงานเฉพาะด้าน เช่น คอมพิวเตอร์ที่ใช้ตรวจวัดคลื่นสมอง คอมพิวเตอร์ที่ใช้ตรวจวัดคลื่นหัวใจ เป็นต้น",
                                "imageCradit": {
                                    "file": "chapter1/1-04.jpg",
                                    "des": "ภาพที่ 1-4 คอมพิวเตอร์แบบใช้งานเฉพาะกิจ (Special Purpose Computer)",
                                    "ref": "(ที่มา: http://www.digibarn.com)"
                                }
                            },
                            {
                                "text": "2.3  ประเภทของคอมพิวเตอร์ตามขนาด และประสิทธิภาพในการประมวลผล  สามารถแบ่งได้เป็น 4 ประเภทคือ 2.3.1  ซูเปอร์คอมพิวเตอร์ (Supercomputer) เป็นคอมพิวเตอร์ที่มีขนาดใหญ่ที่สุด ราคาแพงที่สุด มีหน่วยความจำที่ใหญ่มาก มีความเร็วในการประมวลผล และมีประสิทธิภาพสูงสุดเมื่อเปรียบเทียบกับคอมพิวเตอร์ชนิดอื่น ๆ เหมาะสำหรับงานคำนวณทางคณิตศาสตร์ที่ซับซ้อน ใช้แก้ปัญหาทางวิทยาศาสตร์ และทางวิศวกรรมศาสตร์ได้อย่างรวดเร็ว เช่น การพยากรณ์อากาศล่วงหน้าเป็นเวลาหลายวัน ซูเปอร์คอมพิวเตอร์ มักจะถูกใช้เป็นคอมพิวเตอร์ศูนย์กลางที่มีการทำงานในลักษณะของมัลติโปรเซสซิง (Multiprocessing) สามารถประมวลผลหลาย ๆ งานพร้อมกันได้",
                                "imageCradit": {
                                    "file": "chapter1/1-05.jpg",
                                    "des": "ภาพที่ 1-5 ซุปเปอร์คอมพิวเตอร์ (Supercomputer)",
                                    "ref": "(ที่มา: http://www.digibarn.com)"
                                }
                            },
                            {
                                "text": "2.3.2 คอมพิวเตอร์เมนเฟรม (Mainframe computer) เป็นคอมพิวเตอร์ที่มีความเร็ว และประสิทธิภาพในการทำงานรองลงมาจากซูเปอร์คอมพิวเตอร์ แต่ยังมีความเร็วสูง และมีประสิทธิภาพสูงกว่ามินิคอมพิวเตอร์หรือไมโครคอมพิวเตอร์ เมนเฟรมคอมพิวเตอร์สามารถให้บริการผู้ใช้จำนวนหลายร้อยคนพร้อม ๆ กัน ฉะนั้น จึงสามารถใช้โปรแกรมหลายโปรแกรมในเวลาเดียวกันได้ ปัจจุบันองค์กรใหญ่ ๆ เช่น ธนาคาร จะใช้คอมพิวเตอร์ประเภทนี้ในการทำบัญชีลูกค้า หรือการให้บริการจากเครื่องฝากและถอนเงินแบบอัตโนมัติ (Automatic Teller Machine)",
                                "imageCradit": {
                                    "file": "chapter1/1-06.jpg",
                                    "des": "ภาพที่ 1-6 คอมพิวเตอร์เมนเฟรมหรือคอมพิวเตอร์ขนาดใหญ่ (Mainframe computer)",
                                    "ref": "(ที่มา: http://www.digibarn.com)"
                                }
                            },
                            {
                                "text": "2.3.3  มินิคอมพิวเตอร์ (Minicomputer) คือ เมนเฟรมคอมพิวเตอร์ขนาดเล็ก สามารถบริการผู้ใช้งานได้หลายคนพร้อม ๆ กันประสิทธิภาพยังไม่เทียบเท่าเมนเฟรมคอมพิวเตอร์ได้ เหมาะสำหรับองค์กรขนาดกลาง หรือสำหรับแผนกหนึ่งหรือสาขาหนึ่งขององค์กรขนาดใหญ่เท่านั้น",
                                "imageCradit": {
                                    "file": "chapter1/1-07.jpg",
                                    "des": "ภาพที่ 1-7 มินิคอมพิวเตอร์ (minicomputer)",
                                    "ref": "(ที่มา: http://www.digibarn.com)"
                                }
                            },
                            {
                                "text": "2.3.4  ไมโครคอมพิวเตอร์ (Microcomputer) หรือ พีซี (PC: personal computer) หมายถึงเครื่องคอมพิวเตอร์สำหรับการใช้งานส่วนบุคคล ซึ่งมีขนาดเล็กและราคาถูกกว่าเครื่องคอมพิวเตอร์ประเภทอื่น ๆ มีการใช้งานอย่างแพร่หลายในปัจจุบัน สามารถแบ่งตามลักษณะการใช้งานได้ ดังนี้ 1) เครื่องคอมพิวเตอร์แบบตั้งโต๊ะ (Desktop Computer) เป็นคอมพิวเตอร์ที่ใช้ตามสำนักงาน สถานศึกษา และตามบ้านเรือนทั่วไป เป็นเครื่องที่มีความสามารถสูงและราคาค่อนข้างถูกเมื่อเทียบกับคอมพิวเตอร์ ประเภทอื่น ๆ รวมทั้งมีการพัฒนาอย่างต่อเนื่องทั้งทางด้านอุปกรณ์ฮาร์ดแวร์ หรือโปรแกรม ที่ทำงานร่วมกับเครื่องอย่างสม่ำเสมอ",
                                "imageCradit": {
                                    "file": "chapter1/1-08.jpg",
                                    "des": "ภาพที่ 1-8 คอมพิวเตอร์แบบตั้งโต๊ะ (Desktop Computer)",
                                    "ref": "(ที่มา: http://www.chome.info)"
                                }
                            },
                            {
                                "text": "2) เครื่องคอมพิวเตอร์โน้ตบุ๊ก (Notebook Computer) หมายถึงคอมพิวเตอร์ที่มีขนาดเล็กกว่า เมื่อเทียบกับเครื่องคอมพิวเตอร์แบบตั้งโต๊ะ (Desktop Computer) ข้อดีคือมีขนาดเล็ก สามารถพกพาไปยังสถานที่ต่างๆได้ตามต้องการ ปัจจุบันได้รับความนิยมจากผู้ใช้งานมากขึ้นเพราะราคาของเครื่องเริ่มลดต่ำลงมา",
                                "imageCradit": {
                                    "file": "chapter1/1-09.jpg",
                                    "des": "ภาพที่ 1-9 คอมพิวเตอร์โน้ตบุ๊ก (Notebook Computer)",
                                    "ref": "(ที่มา: http://www.chome.info)"
                                }
                            },
                            {
                                "text": "3) เครื่องคอมพิวเตอร์แทปเล็ตพีซี (Tablet PC) หมายถึงคอมพิวเตอร์ที่รวมเอาความสามารถทั้งหมด ของเครื่องคอมพิวเตอร์โน้ตบุ๊กไว้ในตัว แต่น้ำหนักที่เบากว่า และการป้อนข้อมูลลงบนโปรแกรมต่างๆ ได้ด้วยลายมือของผู้ใช้เองผ่านทางปากกาชนิดพิเศษ (Stylus Pen) รวมทั้งการสั่งงานด้วยเสียง สามารถสลับการทำงานระหว่างโหมดโน้ตบุ๊กเมื่อต้องอยู่ที่โต๊ะทำงาน หรือเปลี่ยนให้อยู่ในโหมด Tablet PC ปกติได้ เมื่อเคลื่อนย้าย หรือต้องเดินทางไปยังสถานที่ต่าง ๆ ",
                                "imageCradit": {
                                    "file": "chapter1/1-10.jpg",
                                    "des": "ภาพที่ 1-10 เครื่องคอมพิวเตอร์แทปเล็ตพีซี (Tablet PC)",
                                    "ref": "(ที่มา: http://www.chome.info)"
                                }
                            },
                            {
                                "text": "4)  คอมพิวเตอร์แบบพกพาขนาดเล็ก (Palmtop Computer) บางครั้งเรียกกันว่าคอมพิวเตอร์มือถือ เป็นเครื่องคอมพิวเตอร์ที่มีขนาดเล็กที่สุด โดยมีขนาดเท่าฝ่ามือ เช่น เครื่อง Palm หรือ Pocket PC ซึ่งกำลังได้รับความนิยมอย่างสูงในปัจจุบัน เพราะพกพาได้สะดวก ป้อนข้อมูลผ่านทางปากกาชนิดพิเศษ เหมาะสำหรับการใช้งานในเชิงธุรกิจ เช่น จดบันทึกนัดหมาย รายชื่อผู้ที่เราติดต่อด้วย รับ/ส่งอีเมล์ วางแผนงาน รวมทั้งสนับสนุนด้านบันเทิงอย่าง เล่นเกม ฟังเพลงหรือไฟล์วีดีโอสั้น ๆ เป็นต้น",
                                "imageCradit": {
                                    "file": "chapter1/1-11.jpg",
                                    "des": "ภาพที่ 1-11 คอมพิวเตอร์แบบพกพาขนาดเล็ก",
                                    "ref": "(ที่มา : http://www.itechnews.net)"
                                }
                            }
                        ]
                    },
                    {
                        "title": "3. ระบบคอมพิวเตอร์ (Computer System)",
                        "content": [
                            {
                                "text": "การทำงานในระบบคอมพิวเตอร์ จะต้องมีส่วนประกอบ 3 ส่วนที่สำคัญ ประกอบกันในการทำงานร่วมกัน ถ้าขาดส่วนใดส่วนหนึ่งทำให้ระบบไม่สมบูรณ์ และไม่สามารถทำงานได้ตรงตามวัตถุประสงค์ หรืออาจไม่สามารถทำงานได้  ระบบของเครื่องคอมพิวเตอร์ประกอบไปด้วย 3.1  ฮาร์ดแวร์ (Hardware) หมายถึง ส่วนที่ประกอบเป็นเครื่องคอมพิวเตอร์สัมผัสได้ เช่น จอภาพ เมาส์  คีย์บอร์ด  เมนบอร์ด  ซีพียู  ฮาร์ดดิสก์  ฟล็อปปี้ดิสก์ไดร์ฟ ซีดีรอมไดร์ฟ การ์ดแสดงผล และการ์ดเสียง เป็นต้น",
                                "imageCradit": {
                                    "file": "chapter1/1-12.jpg",
                                    "des": "ภาพที่ 1-12 ฮาร์ดแวร์ (Hardware)",
                                    "ref": "(ที่มา : http://www.itechnews.net)"
                                }
                            },
                            {
                                "text": "3.2 ซอฟแวร์ (Software) หมายถึง โปรแกรมหรือชุดคำสั่งที่สั่งให้เครื่องคอมพิวเตอร์ ปฏิบัติงานตามจุดประสงค์ ที่เราต้องการ ซอฟแวร์ในระบบสามารถแบ่งได้เป็น 2 ประเภท คือ ซอฟแวร์ระบบ (System Software) และซอฟแวร์ประยุกต์ (Application software) 3.2.1 ซอฟแวร์ระบบ (System Software) คือโปรแกรมหลักที่ใช้ควบคุมการทำงานของเครื่องคอมพิวเตอร์ สำหรับระบบปฏิบัติการที่ใช้บนเครื่องพีซีในปัจจุบัน ได้แก่ Windows เป็นระบบปฏิบัติการที่ได้รับความนิยมมากที่สุดในปัจจุบัน ผลิตโดยบริษัทไมโครซอฟท์เพื่อแทนที่ระบบเดิมอย่าง DOS ที่ทำงานในโหมดข้อความ มาใช้ในรูปภาพแทนคำสั่งต่าง ๆ ระบบปฏิบัติการ Windows ถูกพัฒนามาอย่างต่อเนื่อง เช่น Windows 3.11 Windows 95 Windows 98 Windows Me  Windows XP  Windows Vista และล่าสุดคือ Windows 7 ส่วนระบบปฏิบัติการ Windows 2000  Windows NT และ Windows 2003 ใช้บนเครื่องคอมพิวเตอร์ในระดับเวิร์คสเตชั่น (Workstation) Linux เป็นระบบปฏิบัติการหนึ่งที่ได้รับความนิยมเช่นกันในปัจจุบัน เพราะแจกจ่าย ฟรี และเสถียรภาพ เช่น Red Hat Mandrake และ Linux TLE MacOS เป็นระบบปฏิบัติการ สำหรับคอมพิวเตอร์ที่ผลิตโดยบริษัทแอปเปิล UNIX เป็นระบบปฏิบัติการที่ได้รับความนิยมบนเครื่องคอมพิวเตอร์ในระดับเวิร์คสเตชั่น (Workstation) LindowsOS ระบบปฏิบัติการลูกผสมระหว่าง Windows กับ Linux เป็นต้น 3.2.2 ซอฟแวร์ประยุกต์ (Application software) หรือโปรแกรมสำเร็จรูป เป็นโปรแกรมที่ถูกพัฒนาสำหรับจุดประสงค์ในการทำงานที่ต่างกัน โดยสามารถแบ่งได้เป็นประเภทต่าง ๆ ดังนี้ เวิร์ตโปรเซสเซอร์ โปรแกรมประมวลผลคำ เช่น โปรแกรมMicrosoft Word, โปรแกรม Pladao Writer ใช้ในการสร้างเอกสารทั่วไป สเปรดชีต (Spreadsheet โปรแกรมตารางข้อมูล เช่น โปรแกรม Microsoft Excel, Pladao Cal ใช้ในการคำนวณและวิเคราะห์ข้อมูลตัวเลขดาต้าเบส (Database โปรแกรมจัดการฐานข้อมูล เช่น โปรแกรม Microsoft Access ,MySQL สำหรับระบบข้อมูลเพื่อจัดการข้อมูลอย่างมีประสิทธิภาพกราฟิก (Graphic) โปรแกรมสำหรับงานกราฟิก เช่นโปรแกรม Adobe Photoshop",
                                "imageCradit": {
                                    "file": "chapter1/1-13.jpg",
                                    "des": "ภาพที่ 1-13 ซอฟแวร์ (Software)",
                                    "ref": "(ที่มา: http://www.shop2thai.com)"
                                }
                            },
                            {
                                "text": "3.3 บุคลากร (People ware) หมายถึงบุคลากรที่ปฏิบัติงานทางด้านคอมพิวเตอร์ ถ้าไม่มีบุคลากร  คอมพิวเตอร์จะไม่สามารถทำงานได้หรือทำงานได้แต่ไม่เต็มประสิทธิภาพ สามารถแบ่งหน้าที่ของบุคลากรได้ดังนี้ 3.3.1  นักวิเคราะห์ระบบ (System Analyst) หมายถึง บุคลากรทำหน้าที่ในการวิเคราะห์และออกแบบระบบ เพื่อให้นักเขียนโปรแกรมทำหน้าที่เขียนโปรแกรมต่อไป 3.3.2  นักเขียนโปรแกรม (Programmer) หมายถึง บุคลากรที่ทำหน้าที่ต่อจากนักวิเคราะห์ระบบ คือมีหน้าที่เขียนโปรแกรม หรือพัฒนาโปรแกรมตามที่นักวิเคราะห์ระบบที่ได้ออกแบบไว้แล้ว 3.3.3  ผู้ใช้ (User) หมายถึง ผู้ใช้โปรแกรม หรือซอฟแวร์ต่าง ๆ ให้สามารถใช้งานได้ตามวัตถุประสงค์ของงานที่วางไว้  หรืออาจเป็นการใช้โปรแกรมที่นักเขียนโปรแกรมที่ได้เขียนไว้เรียบร้อยแล้ว"
                            }
                        ]
                    },
                    {
                        "title": "4. หลักการทำงานของระบบคอมพิวเตอร์",
                        "content": [
                            {
                                "text": "คอมพิวเตอร์จะมีหลายรุ่นหลายแบบ และมีความซับซ้อนมากน้อยเพียงไร แต่สามารถแบ่งการทำงานของเครื่องคอมพิวเตอร์ได้เป็น 3 ขั้นตอน โดยแสดงเป็นผังแบบง่าย ๆ ดังนี้",
                                "imageCradit": {
                                    "file": "chapter1/1-14.jpg",
                                    "des": "ภาพที่ 1-14 แสดงขั้นตอนการทำงานของระบบคอมพิวเตอร์",
                                    "ref": "(ที่มา: มานพ ฉิมมา, 2566)"
                                }
                            },
                            {
                                "text": "4.1  หน่วยรับข้อมูล (Input Unit) เป็นส่วนที่ทำหน้าที่รับข้อมูล หรือคำสั่งจากผู้ใช้เข้าสู่เครื่องคอมพิวเตอร์ เช่น คีย์บอร์ดเมาส์ รวมทั้งอุปกรณ์นำเข้าข้อมูลแบบอื่น ๆ เช่น ก้านควบคุม ปากกาชนิดพิเศษ  หรือสแกนเนอร์ เป็นต้น",
                                "imageCradit": {
                                    "file": "chapter1/1-15.jpg",
                                    "des": "ภาพที่ 1-15 หน่วยรับข้อมูล (Input Unit)",
                                    "ref": "(ที่มา :  http://www.itechnews.net)"
                                }
                            },
                            {
                                "text": "4.2  หน่วยประมวลผลกลาง หรือ ซีพียู (CPU: Central Processing Unit) หน่วยประมวลผลกลางเปรียบได้เหมือนกับสมองคอมพิวเตอร์ จะทำหน้าที่ประมวลผลข้อมูลตามคำสั่งที่ได้รับ และควบคุมระบบต่างๆ ของคอมพิวเตอร์ ให้ทุกหน่วยทำงานสอดคล้องสัมพันธ์กัน ",
                                "imageCradit": {
                                    "file": "chapter1/1-16.jpg",
                                    "des": "ภาพที่ 1-16 ซีพียู (CPU: Central Processing Unit)",
                                    "ref": "(ที่มา :  http://www.itechnews.net)"
                                }
                            },
                            {
                                "text": "4.3  หน่วยแสดงผล (Output) เป็นส่วนที่แสดงผล หรือส่งข้อมูลที่ได้จากการประมวลผลมาจากซีพียูให้กับ ผู้ใช้ได้รับทราบ ไม่ว่าจะเป็นทางการมองเห็น หรือส่งเสียงออกมา เช่น  จอภาพ ลำโพง  และเครื่องพิมพ์เป็นต้น",
                                "imageCradit": {
                                    "file": "chapter1/1-17.jpg",
                                    "des": "ภาพที่ 1-17 หน่วยแสดงผล (Output)",
                                    "ref": "(ที่มา: http://www.shop2thai.com)"
                                }
                            },
                            {
                                "text": "4.4 หน่วยความจำ (Memory Unit) นอกจากการทำงานของระบบคอมพิวเตอร์ ทั้ง 3 ขั้นตอนแล้วยังมีส่วนประกอบสำคัญได้แก่ หน่วยความจำ (Memory) ซึ่งจะต้องทำงานร่วมกับหน่วยประมวลผลกลางอยู่ตลอดเวลา หน่วยความจำนั้นแบ่งออกเป็น 2 ประเภท 1) หน่วยความจำหลัก (Main Memory Unit)  สามารถแบ่งได้เป็นหน่วยความจำหลักแบบอ่านได้อย่างเดียว หรือรอม (ROM: Read Only Memory) มีหน้าที่เก็บชุดคำสั่ง หรือโปรแกรม เพื่อใช้ตรวจสอบระบบคอมพิวเตอร์ขณะเริ่มต้นใช้งาน เมื่อปิดเครื่องคอมพิวเตอร์ข้อมูลที่เก็บไว้ จะไม่สูญหาย  หน่วยความจำแบบแก้ไขได้ หรือแรม (RAM: Random Access Memory)เป็นหน่วยความจำความเร็วสูง จะทำงานร่วมกับหน่วยประมวลผลกลาง ในขณะที่หน่วยประมวลผลกลางทำงานหน่วยความจำแรม ก็จะต้องเก็บข้อมูลทุกอย่างนั้นด้วย เมื่อมีการปิดใช้งานเครื่องคอมพิวเตอร์ ข้อมูลจะสูญหายจากแรม",
                                "imageCradit": {
                                    "file": "chapter1/1-18.jpg",
                                    "des": "ภาพที่  1-18 หน่วยความจำหลัก",
                                    "ref": "(ที่มา :  http://www.itechnews.net)"
                                }
                            },
                            {
                                "text": "2) หน่วยความจำรอง (Secondary Storage Unit)  เช่น ฮาร์ดดิสก์   แผ่นดิสก์เก็ต แผ่นซีดี/ดีวีดี หรือ แฟลชไดร์ฟ สำหรับเก็บพักข้อมูล และโปรแกรมต่างๆ บนเครื่องแบบถาวร คือจะไม่สูญหายไปเมื่อปิดเครื่อง ข้อมูลในส่วนนี้เราสามารถแก้ไข ลบ หรือเพิ่มเติมได้ตามที่ต้องการ",
                                "imageCradit": {
                                    "file": "chapter1/1-19.jpg",
                                    "des": "ภาพที่ 1-19 หน่วยความจำรอง",
                                    "ref": "(ที่มา :  http://www.itechnews.net)"
                                }
                            }
                        ]
                    },
                    {
                        "title": "5. ข้อมูล และหน่วยวัดความจุข้อมูล",
                        "content": [
                            {
                                "text": "5.1 ข้อมูล (Data)  หมายถึง ข้อเท็จจริงต่าง ๆ ที่เก็บรวบรวมมาได้ โดยที่จัดเก็บไว้สื่อบันทึกข้อมูลชนิดต่างๆ อาจอยู่ในรูปแบบของ ข้อมูลภาพ ข้อมูลเสียง ข้อมูลตัวเลข ข้อมูลตัวอักษร หรือกราฟ เป็นต้น ซึ่งรูปแบบการเก็บข้อมูลในเครื่องนั้นมีหน่วยเป็นบิต (Bit) ที่มีค่าได้เพียง 2 ค่าคือ 0 หรือ 1 เท่านั้น แฟ้มข้อมูล (File)  หมายถึง ข้อมูลซึ่งเป็นผลลัพธ์ที่ได้จากการใช้งานโปรแกรม หรือ  สื่อบันทึกข้อมูลอื่น แล้วจัดเก็บข้อมูลที่เป็นชนิดเดียวกันไว้ในรูปแบบของแฟ้มข้อมูล โฟลเดอร์ (Folder) หมายถึง แหล่งที่ใช้เก็บแฟ้มข้อมูลต่าง ๆ ซึ่งในแต่ละโฟลเดอร์สามารถเก็บ แฟ้มข้อมูลได้อย่างไม่จำกัด",
                                "imageCradit": {
                                    "file": "chapter1/1-20.jpg",
                                    "des": "ภาพ 1-20 แสดงไฟล์และโฟลเดอร์",
                                    "ref": "(ที่มา: มานพ ฉิมมา, 2566)"
                                }
                            },
                            {
                                "text": "5.2 หน่วยวัดความจุข้อมูลบิต (Bit) เป็นหน่วยวัดข้อมูลที่มีขนาดเล็กที่สุด คำว่า Bit ย่อมาจากคำว่า Binary Digit ซึ่ง ใช้เรียกตัวเลขในระบบเลขฐานสอง คือ 0 และ 1 โดยที่คอมพิวเตอร์เป็นเครื่องอิเล็กทรอนิกส์ชนิดหนึ่ง ซึ่งทำงานด้วยวงจรอิเล็กทรอนิกส์ ที่มี 2 ลักษณะ คือ เมื่อมีสัญญาณไฟฟ้าปิด แทนรหัสด้วย 0 และ เมื่อมีสัญญาณไฟฟ้าเปิด แทนรหัสด้วย 1",
                                "imageCradit": {
                                    "file": "chapter1/1-21.jpg",
                                    "des": "ภาพ 1-21 ตารางหน่วยวัดความจุข้อมูล",
                                    "ref": "(ที่มา: มานพ ฉิมมา, 2566)"
                                }
                            }
                        ]
                    }
                ]
            },
            {
                "chapter": "บทที่ 2",
                "label": "แผงวงจรหลัก (Mainboard)",
                "sections": [
                    {
                        "title": "1.  แผงวงจรหลัก (Mainboard) หรือเรียกอีกชื่อว่า มาเธอร์บอร์ด (Motherboard)",
                        "content": [
                            {
                                "text": "เป็นแผงวงจรขนาดใหญ่เป็นศูนย์กลางการเชื่อมต่ออุปกรณ์ต่าง ๆ เข้าด้วยกัน เช่น ซีพียู หน่วยความจำแรม, การ์ดต่างๆ นอกจากนี้เมนบอร์ดยังเป็นตัวกำหนดในการใช้งานร่วมกับซีพียูรุ่นใดบ้าง มีประสิทธิภาพดีเพียงใด สามารถรองรับอุปกรณ์ใหม่ ๆ ได้หรือไม่"
                            }
                        ]
                    },
                    {
                        "title": "2.  ประเภทแผงวงจรหลักหรือเมนบอร์ด",
                        "content": [
                            {
                                "text": "2.1  เมนบอร์ดชนิด  AT เป็นเมนบอร์ดมีลักษณะเป็นสี่เหลี่ยมผืนผ้า ขั้วรับไฟ   มี12 ขา ปิดเครื่องคอมพิวเตอร์จะใช้สวิทซ์เป็นตัวควบคุมไม่สามารถปิดเครื่องผ่านปุ่มคีย์บอร์ดหรือสั่ง Shutdown ผ่านทางระบบปฏิบัติการ Windows ได้ มีขนาด 12 นิ้ว x13 นิ้ว ปัจจุบันไม่นิยมใช้ 2.2  เมนบอร์ดชนิด  ATX   มีลักษณะคล้ายกับ AT แต่ขนาดเล็กกว่า ขั้วรับไฟ มี   20 ขา ตำแหน่งซีพียูถูกวางไว้ใกล้กับพัดลมระบายความร้อน และใกล้กับหน่วยความจำ สามารถสั่งปิดเครื่องจากระบบปฏิบัติการ Windows ได้ มีขนาด 12 นิ้ว x 9.6 นิ้ว ปัจจุบันไม่นิยมใช้แล้ว 2.3  เมนบอร์ดชนิด  Micro ATX  ลักษณะคล้ายกับรุ่น ATX ขั้วรับไฟมี 24 ขา เมนบอร์ดรุ่นนี้ลดจำนวนสล็อต เหลือเพียง 3 – 4 สล็อต เพื่อทำให้ราคาจำหน่ายถูกลง เหมาะสำหรับการปฏิบัติงานที่ไม่ต้องการเพิ่มอุปกรณ์ต่างๆ มากนัก มีขนาด 9.6 นิ้ว x 9.6 นิ้ว 2.4  เมนบอร์ดชนิด  Flex ATX   มีลักษณะรูปร่าง ที่มีขนาดเล็กที่สุด ขั้วรับไฟมี 24 ขา ทำให้ประหยัดเนื้อที่ เมนบอร์ดชนิดนี้มักมีอุปกรณ์ Onboard ติดตั้งมาพร้อมด้วย เช่น การ์ดเสียง การ์ดจอ และการ์ดโมเด็ม มีขนาด 9 นิ้ว x 7.5 นิ้ว",
                                "imageCradit": {
                                    "file": "chapter2/2-01.jpg",
                                    "des": "ภาพที่ 2-1  แผงวงจรหลัก",
                                    "ref": "(ที่มา: http://www.avalue.com.tw/computer.cfm)"
                                }
                            }
                        ]
                    },
                    {
                        "title": "3.  ส่วนประกอบที่สำคัญของแผงวงจรหลัก",
                        "content": [
                            {
                                "text": "เมนบอร์ดซึ่งเป็นศูนย์กลางในการติดตั้งอุปกรณ์ต่างๆ ทั้งภายในและภายนอก มีช่อง ที่ใช้เสียบอุปกรณ์ต่าง ๆ เรียกว่า สล็อต (Slot) สำหรับการ์ดต่าง ๆ และส่วนของการเชื่อมต่อ เรียกว่า Connector หรือพอร์ตเชื่อมต่อ โดยส่วนประกอบต่าง ๆ ที่สำคัญของเมนบอร์ดมีดังนี้3.1  ชิปเซต 3.2 ซ็อกเก็ตสำหรับติดตั้งซีพียู\t3.3 สล็อตสำหรับติดตั้งแรม 3.4 สล็อตสำหรับติดตั้งการ์ดต่าง ๆ 3.5 ช่องต่ออุปกรณ์ IDE /SATA /FDD 3.6 ช่องต่อไฟเลี้ยงเมนบอร์ด3.7 ชิปไบออส 3.8 จัมพ์เปอร์ 3.9  แบตเตอรี่ 3.10  พอร์ตเชื่อมต่ออุปกรณ์ภายนอก3.11 ระบบบัส 3.12  อุปกรณ์ Onboard",
                                "imageCradit": {
                                    "file": "chapter2/2-02.jpg",
                                    "des": "ภาพที่ 2-2  ส่วนประกอบที่สำคัญของเมนบอร์ด",
                                    "ref": "(ที่มา: http://www.avalue.com.tw/computer.cfm)"
                                }
                            },
                            {
                                "text": "3.1  ชิปเซต  (Chipset)ชิปเซต ทำหน้าที่ควบคุมการทำงานของอุปกรณ์ที่อยู่บนเมนบอร์ด  เพื่อให้อุปกรณ์ต่างๆ ทำงานร่วมกันได้อย่างสอดคล้องกัน ชิปเซตแบ่งได้เป็น 2 ชนิด คือ 1)  Northbridge Chipset ทำหน้าที่ควบคุมอุปกรณ์ที่ทำงานด้วยความเร็วสูงได้แก่ ซีพียู แรม และการ์ดแสดงผล2)   Southbridge Chipset  มีขนาดเล็กกว่า Northbridge Chipset  ทำหน้าที่ ควบคุมอุปกรณ์ที่มีความเร็วต่ำ เช่น  ฮาร์ดดิสก์   ฟล็อปปี้ดิสก์ไดร์ฟ   คีย์บอร์ด   เมาส์  ชิปไบออสช่องเชื่อมต่ออุปกรณ์ (Connector  Port)  รวมทั้งสล็อตสำหรับติดตั้งการ์ด PCI PCI Express x13.2  ซ็อกเก็ตสำหรับติดตั้งซีพียู (Socket)  ซ็อกเก็ต (Socket) เป็นตำแหน่งสำหรับติดตั้งซีพียู โดยรูปแบบของซ็อกเก็ตจะแตกต่างกันไปตามยี่ห้อและรุ่นของซีพียู ในการเลือกเมนบอร์ดจะต้องตรวจสอบก่อนจะติดตั้งซีพียูรุ่นใดได้บ้าง 3.3  สล็อตสำหรับติดตั้งแรม (Memory Slot)เมนบอร์ดแต่ละตัวจะติดตั้งแรมได้ชนิดเดียวเท่านั้น เนื่องจากเมนบอร์ดใช้ชิปเซตที่สนับสนุนแรมเพียงชนิดเดียว แรมต่างรุ่นกันไม่สามารถติดตั้งบนสล็อตเดียวกันได้   เนื่องจากร่องบากบนแรมจะมีระยะห่างไม่เท่ากัน 3.4  สล็อตสำหรับติดตั้งการ์ด (Cards Slot) ขีดความสามารถของเมนบอร์ดขึ้นอยู่กับการมีช่องสำหรับติดตั้งการ์ด (Cards Slot) เพราะหากมีหลายช่อง จะสามารถขยายหรือเพิ่มอุปกรณ์ฮาร์ดแวร์อื่นได้มาก   สล็อตสำหรับติดตั้งการ์ดต่าง ๆ มีดังนี้3.4.1  สล็อตสำหรับติดตั้งการ์ด  ISA (Industry Standard Architecture)  สล็อตสำหรับติดตั้งการ์ด ISA เป็นสล็อตรุ่นเก่า ใช้ติดตั้งการ์ดเสียง การ์ดเครือข่าย (LAN Card) เป็นต้น สล็อตแบบ ISA สามารถส่งข้อมูลได้ 16 บิต    มีความเร็ว 8 MHz เมนบอร์ดในปัจจุบันไม่มีสล็อตแบบนี้แล้ว",
                                "imageCradit": {
                                    "file": "chapter2/2-03.jpg",
                                    "des": "ภาพที่ 2-3  การ์ดเครือข่าย (Lan Card)",
                                    "ref": "(ที่มา : http://www.sunix.com.tw/)"
                                }
                            },
                            {
                                "text": "3.4.2 สล็อต  PCI  (Peripheral Connection Interface) ใช้สำหรับติดตั้งการ์ด เครือข่าย (LAN Card), การ์ดเสียง (Sound Card), การ์ดตัดต่อวีดีโอ (Video Card),   เป็นต้น       มีความเร็วในการรับส่งข้อมูลสูงกว่า การ์ด ISA ส่งข้อมูลได้ 32 บิต โดยมีอัตรารับส่งข้อมูลที่133 MB/s สามารถใช้งานร่วมกับการ์ดที่เป็น 64 บิต",
                                "imageCradit": {
                                    "file": "chapter2/2-04.jpg",
                                    "des": "ภาพที่ 2-4  การ์ดเครือข่าย (Lan Card)",
                                    "ref": "(ที่มา : http://www.sunix.com.tw/)"
                                }
                            },
                            {
                                "text": "3.4.3 สล็อต PCI  Express  (Peripheral  Connection  Interface Express)  เป็นมาตรฐานของการเชื่อมต่อแบบใหม่ที่   จะนำมาใช้แทนสล็อต PCI   เมนบอร์ดในปัจจุบันจะเพิ่มช่องสล็อต PCI Express เพิ่มมาให้การทำงานจะเป็นลักษณะการเชื่อมต่อแบบจุดต่อจุด (Point to Point) โดยมีตัวควบคุมทีเรียกว่า สวิตซ์ (Switch) ทำหน้าที่ควบคุมการรับ/ส่ง ข้อมูลของอุปกรณ์ทั้งหมดที่เชื่อมต่อกันทางบัส สวิตซ์สามารถติดต่อกับหน่วยความจำหลักของเครื่องได้โดยตรง",
                                "imageCradit": {
                                    "file": "chapter2/2-05.jpg",
                                    "des": "ภาพที่ 2-5  การ์ดเครือข่าย (Lan Card)",
                                    "ref": "(ที่มา : http://www.sunix.com.tw/)"
                                }
                            },
                            {
                                "text": "ส่งผลให้ประสิทธิภาพในการทำงานสูงขึ้นตามไปด้วย    ความเร็วในการรับส่งข้อมูล ส่งข้อมูลเริ่มต้นที่250 MB/s สำหรับรุ่น PCI Express x1  สล็อตสำหรับติดตั้งการ์ดแสดงผล  หรือสล็อต AGP (Accelerated Graphics Port) ปัญหาของสล็อต  PCI ไม่สามารถแสดงผลทางด้านกราฟิกที่สนับสนุนกับความเร็วของซีพียูได้ดีพอ บริษัทอินเทลจึงได้พัฒนาสล็อตแบบ AGP สำหรับแสดงผลกราฟิกให้ดียิ่งขึ้นเพื่อให้ทำงานร่วมกับซีพียูที่มีความเร็วสูงได้  ความเร็วในการรับ/ส่งข้อมูลเริ่มต้นที่  AGP  1 X, AGP 2X , AGP  4X  และ AGP 8X  มีอัตรารับ/ส่ง ข้อมูลที่  266MB/s, 533 MB/s , 1064 MB/s  (1GB/s)  และ 2GB/s  ตามลำดับ  สล็อตสำหรับการ์ด PCI Express x16 ซึ่งจะมาใช้แทนสล็อต AGP มีเร็วสูงถึง 4 GB/s ซึ่งมากกว่า สล็อต AGP 8 x ถึง 2 เท่า",
                                "imageCradit": {
                                    "file": "chapter2/2-06.jpg",
                                    "des": "ภาพที่ 2-6  การ์ด AGP  และ การ์ด PCI Express x16",
                                    "ref": "(ที่มา : http://www.sunix.com.tw/)"
                                }
                            },
                            {
                                "text": "3.5  ช่องต่ออุปกรณ์ IDE/ SATA/ FDD 3.5.1 ช่องต่อ IDE ต่ออุปกรณ์ ฮาร์ดดิสก์ และ ไดร์ฟซีดี/ดีวีดี การรับส่งข้อมูลจะเป็นแบบขนาน (Parallel ATA) ช่องต่อ IDE จะถูกติดตั้งอยู่บนเมนบอร์ดด้วยกันทั้งหมด   2 ขั้ว คือ IDE 1 และ IDE 2 แต่ละขั้วสามารถต่ออุปกรณ์ได้ 2 ตัว ซึ่งต้องกำหนดสถานะของอุปกรณ์ให้ตัวหนึ่งเป็นตัวหลัก (Master) และอีกตัวหนึ่งเป็นตัวรอง (Slave)",
                                "imageCradit": {
                                    "file": "chapter2/2-07.jpg",
                                    "des": "ภาพที่ 2-7  การเชื่อมอุปกรณ์แบบ IDE",
                                    "ref": "(ที่มา : http://www.sound-map.com)"
                                }
                            },
                            {
                                "text": "ไดร์ฟซีดี/ดีวีดี ใช้มาตรฐาน Ultra ATA/33 ซึ่งรับส่งข้อมูลได้เร็ว 33 MB/s โดยใช้สายแพ (Ribbon Cable) ขนาด 40 เส้น ขั้วต่อบนเมนบอร์ด 40 ขาฮาร์ดดิสก์ มาตรฐาน Ultra  ATA/33  และ Ultra  ATA/66 รับส่งข้อมูลได้เร็ว  33 MB/s และ 66 MB/s  ต่อมาฮาร์ดดิสก์ได้รับการพัฒนาให้ทำงานได้เร็วขึ้น   เป็น ATA/100  และUltra  ATA/133 รับส่งข้อมูลได้เร็ว 100 MB/s และ 133 MB/s  โดยใช้สายแพขนาด  80 เส้น ขั้วต่อบนเมนบอร์ด 40 ขา",
                                "imageCradit": {
                                    "file": "chapter2/2-08.jpg",
                                    "des": "ภาพที่ 4-8 สายแพ (Ribbon Cable) และการเชื่อมต่อฮาร์ดดิสก์",
                                    "ref": "(ที่มา : http://www.pc-stat.com)"
                                }
                            },
                            {
                                "text": "3.5.2  ช่องต่ออุปกรณ์  Serial  ATA (SATA) เป็นมาตรฐานการเชื่อมต่อแบบใหม่ที่ใช้แทนการเชื่อมต่อแบบ IDE ของฮาร์ดดิสก์ และ ไดร์ฟซีดี/ดีวีดี  ซึ่งสายมีขนาดเล็กโดยมีขาเพียง 7 ขา บนเมนบอร์ดจะมีช่องต่อ Serial ATA จำนวน 4 ช่อง สายสัญญาณ 1 เส้น จะต่อกับอุปกรณ์ได้ 1 ตัว การรับส่งข้อมูลจะเป็นแบบอนุกรม(Serial)  รับส่งข้อมูลทีละบิตอย่างต่อเนื่องโดยมีอัตราความเร็วในการรับ-ส่งข้อมูล เริ่มต้นที่ 150 MB/s  300 MB/s  และในอนาคตพัฒนาเป็น  600 MB/s",
                                "imageCradit": {
                                    "file": "chapter2/2-09.jpg",
                                    "des": "ภาพที่ 4-9 ภาพการเชื่อมต่อ Serial  ATA (SATA)",
                                    "ref": "(ที่มา : http://www.sound-map.com)"
                                }
                            },
                            {
                                "text": "3.5.3  ช่องต่อ FDD (Floppy Disk Drive) ฟล็อปปี้ดิสก์ไดร์ฟเป็นอุปกรณ์เก็บข้อมูลขนาดเล็ก สำหรับช่องต่อฟล็อปปี้ไดร์ฟบนเมนบอร์ดนั้นจะคล้ายกับช่องต่อ IDE โดยมีจำนวนช่องต่อ 1 ขั้วต่อกับฟล็อปปี้ไดร์ฟ 2 ตัว โดยใช้สายแพขนาด 34 เส้นขั้วต่อบนเมนบอร์ด 34 ขา ฟล็อปปี้ไดร์ฟจะกำหนดให้เป็น ไดร์ฟ A: และไดร์ฟ B:  ขนาดของไดร์ฟ 3.5 นิ้วใช้แผ่นบันทึกข้อมูลมีความจุ 1.44 MB",
                                "imageCradit": {
                                    "file": "chapter2/2-10.jpg",
                                    "des": "ภาพที่ 4-10 ฟล็อปปี้ดิสก์ไดร์ฟ และแผ่นบันทึกข้อมูล",
                                    "ref": "(ที่มา : http://www.pc-stat.com)"
                                }
                            }
                        ]
                    }
                ]
            }
        ]
    }
]